// Copyright 2023 alin m elena (@alinelena)
// SPDX-License-Identifier: GPL-2.0-or-later

#include "alinelena_unicode.h"

#ifdef UNICODEMAP_ENABLE
const uint32_t PROGMEM unicode_map[] = {
    [la]   = 0x03B1,  // α
    [lA]   = 0x0307,  //
    [lb]   = 0x03B2,  // β
    [lB]   = 0x2229,  // ∩
    [lc]   = 0x03C7,  // χ
    [lC]   = 0x2282,  // ⊂
    [ld]   = 0x03B4,  // δ
    [lD]   = 0x2202,  // ∂
    [le]   = 0x03B5,  // ε
    [lE]   = 0x2107,  // ℇ
    [lf]   = 0x03C6,  // φ
    [lF]   = 0x03C8,  // ψ
    [lg]   = 0x03B3,  // γ
    [lG]   = 0x0393,  // Γ
    [lh]   = 0x210F,  // ℏ
    [lH]   = 0x1D4D7, // 𝓗
    [li]   = 0x222B,  // ∫
    [lI]   = 0x222E,  // ∮
    [lj]   = 0x2208,  // ∈
    [lJ]   = 0x2209,  // ∉
    [lk]   = 0x03F0,  // ϰ
    [lK]   = 0x2206,  // ∆
    [ll]   = 0x03BB,  // λ
    [lL]   = 0x039B,  // Λ
    [lm]   = 0x03BC,  // μ
    [lM]   = 0x2218,  // ∘
    [ln]   = 0x03B7,  // η
    [lN]   = 0x222A,  // ∪
    [lo]   = 0x221E,  // ∞
    [lO]   = 0x2297,  // ⊗
    [lp]   = 0x03C0,  // π
    [lP]   = 0x220F,  // ∏
    [lq]   = 0x03C3,  // σ
    [lQ]   = 0x03D5,  // ϕ
    [lr]   = 0x03C1,  // ρ
    [lR]   = 0x2207,  // ∇
    [ls]   = 0x2211,  // ∑
    [lS]   = 0x2A0B,  // ⨋
    [lt]   = 0x03D1,  // ϑ
    [lT]   = 0x03B8,  // θ
    [lu]   = 0x03C4,  // τ
    [lU]   = 0x2102,  // ℂ
    [lv]   = 0x03BD,  // χ
    [lV]   = 0x2283,  // ⊃
    [lw]   = 0x03C9,  // ω
    [lW]   = 0x03A9,  // Ω
    [lx]   = 0x03BE,  // ξ
    [lX]   = 0x039E,  // Ξ
    [ly]   = 0x211d,  // ℝ
    [lY]   = 0x2124,  // ℤ
    [lz]   = 0x03B6,  // ζ
    [lZ]   = 0x2221,  // ∡
    [lc1]  = 0x2248,  // ≈
    [lC1]  = 0x2249,  // ≉
    [lp1]  = 0x00B1,  // ±
    [lP1]  = 0x2213,  // ∓
    [lq1]  = 0x00D7,  // ×
    [lQ1]  = 0x22C5,  // ⋅
    [ll1]  = 0x1D53C, // 𝔼
    [lL1]  = 0x212b,  // Å
    [lk1]  = 0x221D,  // ∝
    [lK1]  = 0x2112,  // ℒ
    [lbo1] = 0x22DC,  // ⋜
    [lbo2] = 0x2260,  // ≠
    [lbc1] = 0x22DD,  // ⋝
    [lbc2] = 0x2245,  // ≅
    [ls1]  = 0x2261,  // ≡
    [ls2]  = 0x2262,  // ≢
    [ra]   = 0x0103,  // ă
    [rA]   = 0x0102,  // Ă
    [ra1]  = 0x00E2,  // â
    [rA1]  = 0x00C2,  // Â
    [rx]   = 0x00E7,  // ç
    [rX]   = 0x00C7,  // Ç
    [ri]   = 0x00EE,  // î
    [rI]   = 0x00CE,  // Î
    [rs]   = 0x0219,  // ș⊄
    [rS]   = 0x0218,  // Ș
    [rt]   = 0x021B,  // ț
    [rT]   = 0x021A,  // Ț
    [rc]   = 0x2284,  // ⊄
    [rC]   = 0x2286,  // ⊆
    [rv]   = 0x2285,  // ⊅
    [rV]   = 0x2287,  // ⊇
    [rb]   = 0x2227,  // ∧
    [rB]   = 0x22BC,  // ⊼
    [rn]   = 0x2228,  // ∨
    [rN]   = 0x22BB,  // ⊻
};

#endif
